import React from "react";


const Components=()=>{
  return(
    <>
    <h1>Компоненты</h1>
    <p>Компоненты React — это многократно иcпользуемые фрагменты JavaScript-кода, которые выводят HTML-элементы (благодаря JSX ).</p>
    <p>Компоненты бывают функциональные и классовые.</p>
    <p>Проще всего объявить React-компонент как функцию:</p>
    <pre>
    <code>
      {`
  function Welcome() {
            return <h1>Привет, мир! </h1>;
        }`
    }
    </code>
    </pre>
    <p>Эта функция — компонент, потому что она получает данные в одном объекте («пропсы») в качестве параметра и возвращает React-элемент. 
      Мы будем называть такие компоненты «функциональными», так как они буквально являются функциями.</p>
    <p>Ещё компоненты можно определять как классы ES6:</p>
    <pre>
<code>
{`
  class Welcome extends React.Component {
        render() {
          return <h1>Привет, мир!</h1>;
  }
  }`
}
</code>
    </pre>
    <p>Компонента должна себя вести как чистая функция.</p>
    <ul>«Чистой» называется функция, которая:
    <li>Для одинаковых входных данных всегда возвращает один результат.</li>
    <li>Не имеет побочных эффектов (то есть не изменяет внешние состояния).</li>
    <li>Не зависит от внешних состояний.</li></ul>

    
    </>
  )
}


export default Components